<?php
/**
 * Created by PhpStorm.
 * User: 李志鹏
 */
namespace App\Http\Controllers\Yiban;

class ErrorController extends Controller
{
    protected $errors = [
        'yb_err' => '其它错误情况，具体视实际错误说明',
        's_e' => '系统忙，请稍后再试',
        'pj_e' => '非法操作',
        'e001' => '接口不存在，请确认接口地址正确 | 无效的应用端编号',
        'e002' => '系统忙，请稍后再试 | 无效的应用端回调地址',
        'e003' => '非法请求',
        'e004' => 'http请求方式错误 | 无效的授权令牌',
        'e005' => '接口正在维护，如有不便请谅解 | 授权令牌已过期',
        'e006' => '用户授权凭证已过期，请重新授权 | 无效的授权方式',
        'e007' => '没有足够的权限使用该接口',
        'e008' => '该用户调用接口过于频繁',
        'e009' => '该ip调用接口过于频繁',
        'e010' => '未知错误',
        'e011' => '缺少必填参数或参数格式错误',
        'e012' => '未获取到有效资源',
        'e013' => '易班用户不存在',
        'e014' => '未开通跨校服务',
        'e015' => '易班用户网薪不足',
        'e016' => '学校账户不存在或余额不足',
        'e017' => '未上架应用仅限与debug用户发消息',
        'e018' => '发送消息失败',
        'e019' => '发送消息为空或超过300字符限制',
        'e020' => '好友申请不能发送给自己',
        'e021' => '好友申请理由超过50字符限制',
        'e022' => '删除好友失败或非好友关系',
        'e023' => '该用户暂时不愿被打扰',
        'e024' => '该用户暂未完成校方认证',
        'e025' => '动态评论内容必填且最多500字符',
        'e026' => '该群不存在（公共群/机构群）',
        'e027' => '发送话题失败',
        'e028' => '话题内容必填且最多10000字数限制',
        'e029' => '话题评论内容必填且最多140字数限制',
        'e030' => '发送话题评论失败',
        'e031' => '该话题不存在或已被删除',
        'e032' => '当前用户无法删除该话题',
        'e033' => '当前用户无法删除该评论',
        'e034' => '话题标题必填且最多50字符限制',
        'e035' => '该群为非行政类公共群，无EGPA统计',
        'e036' => '行政机构号名称错误',
        'e037' => '内容存在敏感词',
        'e038' => '该机构号不存在',
        'e039' => '单次批量通知上限100条',
        'e040' => '未上架或维护状态，暂时不开启该功能',
        'e041' => '未开通校级服务',
        'e042' => '验证签名已失效',
        'e043' => '输入中文字符串必须为UTF-8编码',
        'e044' => '上传文件失败',
        'e045' => '上传文件名存在非法字符',
        'e046' => '上传文件大小超过上限',
        'e047' => '非校方认证用户无法网薪交易',
        'e048' => '非校方认证用户无法成为交易收益方',
        'e049' => '动态内容必填且最多1000字符',
        'e050' => '分享标题必填且最多50字符',
        'e051' => '分享简介必填且最多200字符',
        'e052' => '分享源地址格式错误',
        'e053' => '分享图片地址格式错误',
        'e054' => '请提供精确的学校名称',
        'e055' => '请勿重复校方认证',
        'e056' => '学校暂未提供认证信息',
    ];

    /**
     * @param $info
     * @return mixed|string
     */
    public function __invoke($info)
    {
        $code = $info->code;
        if (array_key_exists($code, $this->errors)) {
            return $this->errors[$code];
        } else {
            return "未知错误！";
        }
    }
}
